In [2]:
# Series --> Sequence of elements
# pandas implementation

In [3]:
import pandas as pd

In [4]:
# using list

l1=[1,2,3,4,5,6,7]
s1=pd.Series(l1)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [5]:
print(s1[0])

1

In [6]:
print(s1[1:4])

1    2
2    3
3    4
dtype: int64

In [7]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [8]:
# To change the index values of series  --
l2=[1,2,3,4,5]

s2=pd.Series(data=l2,index=["a","b","c","d","e"])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s2["d"]

4

### Using tuple--

In [10]:
t1=(12,13,14,15)
s3=pd.Series(t1)
print(s3)

0    12
1    13
2    14
3    15
dtype: int64

### Using Dictionary--

In [11]:
dict1={"a":1,"b":2,"c":3}
s4=pd.Series(dict1)
print(s4)

a    1
b    2
c    3
dtype: int64

In [12]:
# Using numpy array---

import numpy as np
n1=np.arange(8)
s5=pd.Series(n1)
print(s5)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int32

### Creating dataframe--

In [13]:
ss1=pd.Series(data=np.arange(5))
ss2=pd.Series(data=np.array([10,20,30]))
print(ss1)
print(ss2)

0    0
1    1
2    2
3    3
4    4
dtype: int32
0    10
1    20
2    30
dtype: int32

In [14]:
df=pd.concat([ss1,ss2],axis=1)   #column wise concatenation
print(df)
print(type(df))

   0     1
0  0  10.0
1  1  20.0
2  2  30.0
3  3   NaN
4  4   NaN
<class 'pandas.core.frame.DataFrame'>

In [15]:
# pandas dataframe using list---
l1=[[1,2,3],[4,5,6],[7,8,9]]      # 2-D 
df1=pd.DataFrame(data=l1,index=["row1","row2","row3"],columns=["col1","col2","col3"])
df1

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [16]:
# Using Tuple to create dataframe--

t1=((1,2,3),(4,5,6),(7,8,9))
df2=pd.DataFrame(data=t1,index=["row1","row2","row3"],columns=["col1","col2","col3"])
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [17]:
# Using Dictionary --

dict={"col1":[12,13,14],"col2":[45,2,1],"col3":[34,3,4]}
df3=pd.DataFrame(data=dict,index=["row1","row2","row3"])
df3

      col1  col2  col3
row1    12    45    34
row2    13     2     3
row3    14     1     4

In [18]:
# Using numpy arrays--

n1=np.array([[1,2,3],[4,5,6]])
df4=pd.DataFrame(data=n1,index=["row1","row2"],columns=["col1","col2","col3"])
df4

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [19]:
dict1={"Name":["rahul","lovi","chetan"],"Age":[20,22,25],"College":["SSIET","JMIET","LPU"]}
data=pd.DataFrame(data=dict1)
data

     Name  Age College
0   rahul   20   SSIET
1    lovi   22   JMIET
2  chetan   25     LPU

In [20]:
# Accessing dataframe---

data.Name

0     rahul
1      lovi
2    chetan
Name: Name, dtype: object

In [21]:
#  Accessing dataframe using single square bracket--

data["Name"]

0     rahul
1      lovi
2    chetan
Name: Name, dtype: object

In [22]:
data[["Name"]]

     Name
0   rahul
1    lovi
2  chetan

In [23]:
data.Name[0:2]

0    rahul
1     lovi
Name: Name, dtype: object

In [24]:
data[["Name"]][0:2]

    Name
0  rahul
1   lovi

In [25]:
data[['Name','Age']][0:2]

    Name  Age
0  rahul   20
1   lovi   22

In [26]:
data[['Name','College']][0:2]

    Name College
0  rahul   SSIET
1   lovi   JMIET

In [27]:
# Loc-->Location based accessing(label based accessing)
data

     Name  Age College
0   rahul   20   SSIET
1    lovi   22   JMIET
2  chetan   25     LPU

In [28]:
data.loc[0:1,"Name":"College"]

    Name  Age College
0  rahul   20   SSIET
1   lovi   22   JMIET

In [29]:
data.loc[[0,2],["Name","Age"]]

     Name  Age
0   rahul   20
2  chetan   25

In [30]:
# iloc -->Integer based accessing...

data.iloc[0:2,0:2]

    Name  Age
0  rahul   20
1   lovi   22

In [31]:
data.iloc[[0,2],[0,2]]           # randomly accessing the rows and columns...

     Name College
0   rahul   SSIET
2  chetan     LPU

In [32]:
dict2={"Emp Id":[101,102,103],"Emp Name":["Divya","Lovpreet","Chitra"],"Designation":["ML Engg.","DBA","DA"]}
data=pd.DataFrame(data=dict2)
data

   Emp Id  Emp Name Designation
0     101     Divya    ML Engg.
1     102  Lovpreet         DBA
2     103    Chitra          DA

In [33]:
data[["Emp Id"]][0:2]

   Emp Id
0     101
1     102

In [34]:
data.loc[0:2,"Emp Id":"Designation"]

   Emp Id  Emp Name Designation
0     101     Divya    ML Engg.
1     102  Lovpreet         DBA
2     103    Chitra          DA

In [35]:
data.iloc[[0,2],[0,2]]

   Emp Id Designation
0     101    ML Engg.
2     103          DA

In [36]:
# Adding column....

data["Address"]=["Jalandhar","Jalandhar","Chennai"]

In [37]:
data

   Emp Id  Emp Name Designation    Address
0     101     Divya    ML Engg.  Jalandhar
1     102  Lovpreet         DBA  Jalandhar
2     103    Chitra          DA    Chennai

In [38]:
dict2={"Emp Id":104,"Emp Name":"abc","Designation":"dba","Address":"abcd"}     #adding the row in dataframe

In [39]:
data.append(dict2,ignore_index=True)

   Emp Id  Emp Name Designation    Address
0     101     Divya    ML Engg.  Jalandhar
1     102  Lovpreet         DBA  Jalandhar
2     103    Chitra          DA    Chennai
3     104       abc         dba       abcd

In [40]:
#  drop columns..

data.drop(["Address"],axis=1)       # not a permanent dropping

   Emp Id  Emp Name Designation
0     101     Divya    ML Engg.
1     102  Lovpreet         DBA
2     103    Chitra          DA

In [41]:
data

   Emp Id  Emp Name Designation    Address
0     101     Divya    ML Engg.  Jalandhar
1     102  Lovpreet         DBA  Jalandhar
2     103    Chitra          DA    Chennai

In [42]:
data.drop(["Address"],axis=1,inplace=True)   #inplace= True does a permanent dropping..

In [43]:
data

   Emp Id  Emp Name Designation
0     101     Divya    ML Engg.
1     102  Lovpreet         DBA
2     103    Chitra          DA

In [44]:
#  If we want to drop multiple columns---

data.drop(["Emp Id","Emp Name"],axis=1)

  Designation
0    ML Engg.
1         DBA
2          DA

In [45]:
# To drop rows..

data.drop([2,0])

   Emp Id  Emp Name Designation
1     102  Lovpreet         DBA

In [46]:
dict1={"Name":["rahul","lovi","chetan"],"Age":[20,22,25],"College":["SSIET","JMIET","LPU"]}
data=pd.DataFrame(data=dict1)
data

     Name  Age College
0   rahul   20   SSIET
1    lovi   22   JMIET
2  chetan   25     LPU

In [47]:
# Just adding the columns here...

data["percentage"]=[90,np.NaN,85]     # np.NaN indicates not a number

In [48]:
data["hrs_studied"]=[5,4,3]

In [49]:
data["Degree"]=["B.tech","Bsc","BCA"]

In [50]:
data             # %age and hrs_studied are corelated with each other

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET         NaN            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

### Pipeline of Project---
1. Problem statement
2. Start collecting data
3. Data pre processing stage-->handling missing values,treating outliers,performing feature engg.,feature transformation.
4. Data Visualization--> Exploratory data analysis
5. Choosing M.L. Algorithm
6. Optimization of the model--> model tuning,feature selection
7. Productionize your model ( mlops.)
8. Test data in real world

In [51]:
# Note:--> [[[MISSING VALUES]]]
# more than 50% missing values then drop that columns..
# mean imputation--> check the distribution
# median imputation--> check the skewness
# Mode--> for categorical value
# drop column if it is not important
# drop rows by default

In [52]:
data

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET         NaN            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [53]:
data.dropna()         # drop the row having NaN

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
2  chetan   25     LPU        85.0            3     BCA

In [54]:
data.dropna(axis=1)

     Name  Age College  hrs_studied  Degree
0   rahul   20   SSIET            5  B.tech
1    lovi   22   JMIET            4     Bsc
2  chetan   25     LPU            3     BCA

In [55]:
# Imputing----

data.fillna(data.percentage.mean())

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET        87.5            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [56]:
data.fillna(data.percentage.median())

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET        87.5            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [57]:
data

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET         NaN            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [58]:
l1=np.array([1,78,98,100])
l1.mean()

69.25

In [59]:
np.median(l1)

88.0

In [60]:
# multiindexing....

d=pd.DataFrame({"a":[1,2,3],"b":[2,4,5],"c":[7,8,3]},index=pd.MultiIndex.from_tuples([("d",1),("b",2),("e",3)],names=["n","v"]))

In [61]:
d

     a  b  c
n v
d 1  1  2  7
b 2  2  4  8
e 3  3  5  3

In [62]:
# Gather columns into rows....

pd.melt(d)

  variable  value
0        a      1
1        a      2
2        a      3
3        b      2
4        b      4
5        b      5
6        c      7
7        c      8
8        c      3

In [63]:
d.expanding()

Expanding [min_periods=1,center=False,axis=0]

In [64]:
d.rolling(2)

Rolling [window=2,center=False,axis=0]

In [65]:
data.bfill()      #backward  fill

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET        85.0            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [66]:
data.backfill()

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET        85.0            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [67]:
data

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET         NaN            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [68]:
data.ffill()             # forward fill

     Name  Age College  percentage  hrs_studied  Degree
0   rahul   20   SSIET        90.0            5  B.tech
1    lovi   22   JMIET        90.0            4     Bsc
2  chetan   25     LPU        85.0            3     BCA

In [89]:
# Interpolation-->
# Extra polation-->

In [70]:
# filtering the data--->
# query--> fetch students who are from bangaolre

data["Address"]=["bangalore","bangalore","pune"]
data

     Name  Age College  percentage  hrs_studied  Degree    Address
0   rahul   20   SSIET        90.0            5  B.tech  bangalore
1    lovi   22   JMIET         NaN            4     Bsc  bangalore
2  chetan   25     LPU        85.0            3     BCA       pune

In [71]:
data[data.Address=="bangalore"]

    Name  Age College  percentage  hrs_studied  Degree    Address
0  rahul   20   SSIET        90.0            5  B.tech  bangalore
1   lovi   22   JMIET         NaN            4     Bsc  bangalore

In [72]:
# Query--> whose percentage is eual to 90 and belongs to bangalore 

data[(data.percentage == 90) & (data.Address=="bangalore")]

    Name  Age College  percentage  hrs_studied  Degree    Address
0  rahul   20   SSIET        90.0            5  B.tech  bangalore

In [73]:
data

     Name  Age College  percentage  hrs_studied  Degree    Address
0   rahul   20   SSIET        90.0            5  B.tech  bangalore
1    lovi   22   JMIET         NaN            4     Bsc  bangalore
2  chetan   25     LPU        85.0            3     BCA       pune

In [74]:
# Basic check--->

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         3 non-null      object
 1   Age          3 non-null      int64
 2   College      3 non-null      object
 3   percentage   2 non-null      float64
 4   hrs_studied  3 non-null      int64
 5   Degree       3 non-null      object
 6   Address      3 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 296.0+ bytes

In [75]:
data.head()       # display top 5 records

     Name  Age College  percentage  hrs_studied  Degree    Address
0   rahul   20   SSIET        90.0            5  B.tech  bangalore
1    lovi   22   JMIET         NaN            4     Bsc  bangalore
2  chetan   25     LPU        85.0            3     BCA       pune

In [76]:
data.tail()     # last 5 records

     Name  Age College  percentage  hrs_studied  Degree    Address
0   rahul   20   SSIET        90.0            5  B.tech  bangalore
1    lovi   22   JMIET         NaN            4     Bsc  bangalore
2  chetan   25     LPU        85.0            3     BCA       pune

In [77]:
data.isnull()               # where there is missing values then we get true

    Name    Age  College  percentage  hrs_studied  Degree  Address
0  False  False    False       False        False   False    False
1  False  False    False        True        False   False    False
2  False  False    False       False        False   False    False

In [78]:
data.isnull().sum()

Name           0
Age            0
College        0
percentage     1
hrs_studied    0
Degree         0
Address        0
dtype: int64

In [79]:
data.isnull().sum()/len(data)*100          #checking the percentage of missing values

Name            0.000000
Age             0.000000
College         0.000000
percentage     33.333333
hrs_studied     0.000000
Degree          0.000000
Address         0.000000
dtype: float64

In [80]:
# Rename the column names-->

data.rename({"percentage" : "%age","Name":"First_name"},axis=1)

  First_name  Age College  %age  hrs_studied  Degree    Address
0      rahul   20   SSIET  90.0            5  B.tech  bangalore
1       lovi   22   JMIET   NaN            4     Bsc  bangalore
2     chetan   25     LPU  85.0            3     BCA       pune

In [81]:
import pandas as pd
data=pd.DataFrame({"emp_id":[101,102,103,104,105],"emp_name":["A","B","C","D","E"],"sal":[10000,20000,24000,46000,40000],
      "DOJ":["1 feb","1 jan","5 mar","31sep","10 oct"]})
data

   emp_id emp_name    sal     DOJ
0     101        A  10000   1 feb
1     102        B  20000   1 jan
2     103        C  24000   5 mar
3     104        D  46000   31sep
4     105        E  40000  10 oct

In [88]:
data.rename({"sal":"salary"},axis=1)

   emp_id emp_name  salary     DOJ
0     101        A   10000   1 feb
1     102        B   20000   1 jan
2     103        C   24000   5 mar
3     104        D   46000   31sep
4     105        E   40000  10 oct

In [82]:
data.loc[data["sal"]>20000,["emp_id","emp_name"]]

   emp_id emp_name
2     103        C
3     104        D
4     105        E

In [86]:
# downcasting loop-->

for column in data:
    if data[column].dtype=='float64':
        data[column]=pd.to_numeric(data[column],downcast='float')
#     if data[column].dtype=='int64':
#         data[column]=pd.to_numeric(data[column],downcast='int')

In [87]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   emp_id    5 non-null      int64
 1   emp_name  5 non-null      object
 2   sal       5 non-null      int64
 3   DOJ       5 non-null      object
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes